iDynamicsPackagesModules/Evaluations/Cluster_5_Nodes/Policy1_eval_Graph_dynamics/Policy1_evaluated_data/wrk2_response_data/output_result_2025_03_18_07_01.txt
Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 166.151ms, rate sampling interval: 335ms
  Thread calibration: mean lat.: 178.671ms, rate sampling interval: 339ms
  Thread calibration: mean lat.: 166.081ms, rate sampling interval: 328ms
  Thread calibration: mean lat.: 192.259ms, rate sampling interval: 440ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   168.60ms   24.87ms 299.01ms   91.76%
    Req/Sec     6.34      4.29    18.00     80.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  161.15ms
 75.000%  162.94ms
 90.000%  187.26ms
 99.000%  299.01ms
 99.900%  370.43ms
 99.990%  443.65ms
 99.999%  443.65ms
100.000%  443.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     156.287     0.000000            1         1.00
     159.103     0.100000          334         1.11
     159.743     0.200000          653         1.25
     160.255     0.300000          957         1.43
     160.767     0.400000         1271         1.67
     161.151     0.500000         1524         2.00
     161.535     0.550000         1756         2.22
     161.791     0.600000         1886         2.50
     162.047     0.650000         2007         2.86
     162.431     0.700000         2171         3.33
     162.943     0.750000         2305         4.00
     163.199     0.775000         2363         4.44
     163.839     0.800000         2451         5.00
     164.735     0.825000         2518         5.71
     167.167     0.850000         2590         6.67
     177.279     0.875000         2667         8.00
     183.807     0.887500         2704         8.89
     187.263     0.900000         2743        10.00
     191.871     0.912500         2780        11.43
     199.423     0.925000         2819        13.33
     205.183     0.937500         2857        16.00
     209.663     0.943750         2875        17.78
     214.783     0.950000         2894        20.00
     217.471     0.956250         2913        22.86
     225.023     0.962500         2932        26.67
     236.543     0.968750         2951        32.00
     239.487     0.971875         2962        35.56
     245.887     0.975000         2970        40.00
     255.871     0.978125         2980        45.71
     265.983     0.981250         2989        53.33
     278.015     0.984375         2999        64.00
     281.599     0.985938         3004        71.11
     286.975     0.987500         3008        80.00
     295.423     0.989062         3013        91.43
     300.543     0.990625         3019       106.67
     303.359     0.992188         3023       128.00
     305.407     0.992969         3025       142.22
     309.503     0.993750         3027       160.00
     314.111     0.994531         3030       182.86
     320.255     0.995313         3032       213.33
     321.535     0.996094         3035       256.00
     323.583     0.996484         3036       284.44
     324.351     0.996875         3037       320.00
     334.591     0.997266         3038       365.71
     343.295     0.997656         3039       426.67
     351.487     0.998047         3041       512.00
     351.487     0.998242         3041       568.89
     353.791     0.998437         3042       640.00
     353.791     0.998633         3042       731.43
     370.431     0.998828         3043       853.33
     380.927     0.999023         3044      1024.00
     380.927     0.999121         3044      1137.78
     380.927     0.999219         3044      1280.00
     380.927     0.999316         3044      1462.86
     392.959     0.999414         3045      1706.67
     392.959     0.999512         3045      2048.00
     392.959     0.999561         3045      2275.56
     392.959     0.999609         3045      2560.00
     392.959     0.999658         3045      2925.71
     443.647     0.999707         3046      3413.33
     443.647     1.000000         3046          inf
#[Mean    =      168.596, StdDeviation   =       24.869]
#[Max     =      443.392, Total count    =         3046]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  3326 requests in 2.00m, 0.95MB read
  Socket errors: connect 0, read 0, write 0, timeout 3400
Requests/sec:     27.71  
Transfer/sec:      8.12KB


Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 169.138ms, rate sampling interval: 352ms
  Thread calibration: mean lat.: 174.254ms, rate sampling interval: 440ms
  Thread calibration: mean lat.: 163.976ms, rate sampling interval: 330ms
  Thread calibration: mean lat.: 182.116ms, rate sampling interval: 437ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   171.76ms   20.17ms 243.84ms   88.22%
    Req/Sec     1.83      2.16     9.00     88.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  164.22ms
 75.000%  166.53ms
 90.000%  195.46ms
 99.000%  243.84ms
 99.900%  306.43ms
 99.990%  356.86ms
 99.999%  356.86ms
100.000%  356.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     158.719     0.000000            1         1.00
     161.663     0.100000          104         1.11
     162.431     0.200000          190         1.25
     163.071     0.300000          282         1.43
     163.583     0.400000          370         1.67
     164.223     0.500000          466         2.00
     164.479     0.550000          500         2.22
     164.863     0.600000          548         2.50
     165.247     0.650000          585         2.86
     165.759     0.700000          636         3.33
     166.527     0.750000          679         4.00
     167.167     0.775000          700         4.44
     169.215     0.800000          720         5.00
     180.095     0.825000          743         5.71
     186.751     0.850000          767         6.67
     191.231     0.875000          790         8.00
     193.151     0.887500          799         8.89
     195.455     0.900000          810        10.00
     196.991     0.912500          822        11.43
     207.487     0.925000          833        13.33
     216.191     0.937500          844        16.00
     217.215     0.943750          850        17.78
     219.775     0.950000          855        20.00
     222.591     0.956250          861        22.86
     227.199     0.962500          867        26.67
     228.479     0.968750          872        32.00
     229.887     0.971875          875        35.56
     230.655     0.975000          878        40.00
     233.343     0.978125          881        45.71
     236.927     0.981250          884        53.33
     237.695     0.984375          886        64.00
     240.639     0.985938          888        71.11
     241.151     0.987500          889        80.00
     243.839     0.989062          891        91.43
     249.087     0.990625          892       106.67
     251.135     0.992188          893       128.00
     265.727     0.992969          895       142.22
     265.727     0.993750          895       160.00
     265.983     0.994531          896       182.86
     265.983     0.995313          896       213.33
     271.359     0.996094          897       256.00
     271.359     0.996484          897       284.44
     272.127     0.996875          898       320.00
     272.127     0.997266          898       365.71
     272.127     0.997656          898       426.67
     306.431     0.998047          899       512.00
     306.431     0.998242          899       568.89
     306.431     0.998437          899       640.00
     306.431     0.998633          899       731.43
     306.431     0.998828          899       853.33
     356.863     0.999023          900      1024.00
     356.863     1.000000          900          inf
#[Mean    =      171.758, StdDeviation   =       20.169]
#[Max     =      356.608, Total count    =          900]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  989 requests in 2.00m, 289.75KB read
  Socket errors: connect 0, read 0, write 0, timeout 5076
Requests/sec:      8.24  
Transfer/sec:      2.41KB


Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 167.289ms, rate sampling interval: 346ms
  Thread calibration: mean lat.: 170.591ms, rate sampling interval: 382ms
  Thread calibration: mean lat.: 170.480ms, rate sampling interval: 375ms
  Thread calibration: mean lat.: 169.687ms, rate sampling interval: 383ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   171.22ms   33.17ms 315.65ms   91.11%
    Req/Sec    11.43      5.61    26.00     83.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  160.64ms
 75.000%  162.43ms
 90.000%  195.97ms
 99.000%  315.65ms
 99.900%  439.30ms
 99.990%  515.84ms
 99.999%  621.05ms
100.000%  621.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     155.775     0.000000            1         1.00
     158.591     0.100000          568         1.11
     159.231     0.200000         1061         1.25
     159.743     0.300000         1606         1.43
     160.255     0.400000         2216         1.67
     160.639     0.500000         2642         2.00
     160.895     0.550000         2892         2.22
     161.151     0.600000         3161         2.50
     161.535     0.650000         3450         2.86
     161.919     0.700000         3706         3.33
     162.431     0.750000         3937         4.00
     162.815     0.775000         4062         4.44
     163.455     0.800000         4196         5.00
     165.119     0.825000         4316         5.71
     171.391     0.850000         4445         6.67
     185.599     0.875000         4575         8.00
     190.975     0.887500         4643         8.89
     196.223     0.900000         4706        10.00
     205.311     0.912500         4772        11.43
     214.655     0.925000         4836        13.33
     225.535     0.937500         4903        16.00
     234.879     0.943750         4934        17.78
     243.583     0.950000         4967        20.00
     252.927     0.956250         5000        22.86
     264.959     0.962500         5033        26.67
     272.383     0.968750         5065        32.00
     278.527     0.971875         5083        35.56
     284.927     0.975000         5098        40.00
     291.583     0.978125         5114        45.71
     298.239     0.981250         5130        53.33
     305.151     0.984375         5147        64.00
     307.455     0.985938         5155        71.11
     311.295     0.987500         5166        80.00
     313.087     0.989062         5171        91.43
     316.415     0.990625         5179       106.67
     321.791     0.992188         5188       128.00
     326.143     0.992969         5192       142.22
     329.983     0.993750         5196       160.00
     337.919     0.994531         5200       182.86
     353.023     0.995313         5204       213.33
     358.143     0.996094         5208       256.00
     358.655     0.996484         5210       284.44
     367.359     0.996875         5212       320.00
     379.135     0.997266         5214       365.71
     391.679     0.997656         5216       426.67
     396.031     0.998047         5218       512.00
     401.407     0.998242         5219       568.89
     405.247     0.998437         5220       640.00
     409.087     0.998633         5221       731.43
     412.159     0.998828         5222       853.33
     439.295     0.999023         5223      1024.00
     470.527     0.999121         5224      1137.78
     470.527     0.999219         5224      1280.00
     471.807     0.999316         5225      1462.86
     471.807     0.999414         5225      1706.67
     477.951     0.999512         5226      2048.00
     477.951     0.999561         5226      2275.56
     477.951     0.999609         5226      2560.00
     515.839     0.999658         5227      2925.71
     515.839     0.999707         5227      3413.33
     515.839     0.999756         5227      4096.00
     515.839     0.999780         5227      4551.11
     515.839     0.999805         5227      5120.00
     621.055     0.999829         5228      5851.43
     621.055     1.000000         5228          inf
#[Mean    =      171.217, StdDeviation   =       33.174]
#[Max     =      620.544, Total count    =         5228]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5744 requests in 2.00m, 1.64MB read
  Socket errors: connect 0, read 0, write 0, timeout 2299
Requests/sec:     47.85  
Transfer/sec:     14.02KB


Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080
  4 threads and 100 connections

  Thread calibration: mean lat.: 173.866ms, rate sampling interval: 426ms
  Thread calibration: mean lat.: 169.779ms, rate sampling interval: 406ms
  Thread calibration: mean lat.: 172.350ms, rate sampling interval: 404ms
  Thread calibration: mean lat.: 168.392ms, rate sampling interval: 345ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   174.21ms   39.46ms 326.91ms   89.95%
    Req/Sec    16.41      6.21    32.00     70.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  160.38ms
 75.000%  162.82ms
 90.000%  213.89ms
 99.000%  326.91ms
 99.900%  454.14ms
 99.990%  633.34ms
 99.999%  637.44ms
100.000%  637.44ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     155.007     0.000000            1         1.00
     158.207     0.100000          764         1.11
     158.847     0.200000         1511         1.25
     159.359     0.300000         2315         1.43
     159.871     0.400000         3119         1.67
     160.383     0.500000         3840         2.00
     160.639     0.550000         4185         2.22
     161.023     0.600000         4584         2.50
     161.407     0.650000         4901         2.86
     161.919     0.700000         5216         3.33
     162.815     0.750000         5592         4.00
     163.583     0.775000         5768         4.44
     165.247     0.800000         5935         5.00
     171.007     0.825000         6122         5.71
     183.679     0.850000         6304         6.67
     196.607     0.875000         6490         8.00
     205.439     0.887500         6584         8.89
     214.015     0.900000         6675        10.00
     224.767     0.912500         6768        11.43
     236.671     0.925000         6861        13.33
     251.391     0.937500         6953        16.00
     262.143     0.943750         7000        17.78
     271.359     0.950000         7046        20.00
     279.551     0.956250         7093        22.86
     286.975     0.962500         7140        26.67
     296.703     0.968750         7186        32.00
     299.519     0.971875         7209        35.56
     303.615     0.975000         7231        40.00
     307.455     0.978125         7256        45.71
     311.295     0.981250         7277        53.33
     315.135     0.984375         7301        64.00
     317.695     0.985938         7312        71.11
     319.487     0.987500         7324        80.00
     322.303     0.989062         7335        91.43
     330.495     0.990625         7348       106.67
     347.647     0.992188         7359       128.00
     350.719     0.992969         7364       142.22
     358.911     0.993750         7371       160.00
     367.615     0.994531         7376       182.86
     381.695     0.995313         7382       213.33
     391.679     0.996094         7388       256.00
     401.663     0.996484         7390       284.44
     407.807     0.996875         7393       320.00
     422.399     0.997266         7396       365.71
     427.007     0.997656         7399       426.67
     433.407     0.998047         7402       512.00
     434.943     0.998242         7403       568.89
     438.015     0.998437         7405       640.00
     440.831     0.998633         7406       731.43
     451.327     0.998828         7408       853.33
     454.143     0.999023         7409      1024.00
     474.879     0.999121         7410      1137.78
     487.935     0.999219         7411      1280.00
     487.935     0.999316         7411      1462.86
     491.519     0.999414         7412      1706.67
     558.079     0.999512         7413      2048.00
     558.079     0.999561         7413      2275.56
     588.287     0.999609         7414      2560.00
     588.287     0.999658         7414      2925.71
     588.287     0.999707         7414      3413.33
     633.343     0.999756         7415      4096.00
     633.343     0.999780         7415      4551.11
     633.343     0.999805         7415      5120.00
     633.343     0.999829         7415      5851.43
     633.343     0.999854         7415      6826.67
     637.439     0.999878         7416      8192.00
     637.439     1.000000         7416          inf
#[Mean    =      174.209, StdDeviation   =       39.457]
#[Max     =      636.928, Total count    =         7416]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  8125 requests in 2.00m, 2.32MB read
  Socket errors: connect 0, read 0, write 0, timeout 1512
Requests/sec:     67.69  
Transfer/sec:     19.83KB